Lesson 3: Performance Testing/walkthroughresults/statistics.json
{
  "" : {
    "transaction" : "",
    "sampleCount" : 1,
    "errorCount" : 1,
    "errorPct" : 100.0,
    "meanResTime" : 0.0,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 0.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 0.0,
    "pct3ResTime" : 0.0,
    "throughput" : "Infinity",
    "receivedKBytesPerSec" : "Infinity",
    "sentKBytesPerSec" : "NaN"
  },
  "GET users" : {
    "transaction" : "GET users",
    "sampleCount" : 19,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 852.8421052631578,
    "medianResTime" : 1049.0,
    "minResTime" : 25.0,
    "maxResTime" : 1653.0,
    "pct1ResTime" : 1421.0,
    "pct2ResTime" : 1653.0,
    "pct3ResTime" : 1653.0,
    "throughput" : 0.011091865751062338,
    "receivedKBytesPerSec" : 1.675186423614699,
    "sentKBytesPerSec" : 0.0019622842267247413
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 25,
    "errorCount" : 1,
    "errorPct" : 4.0,
    "meanResTime" : 710.1600000000001,
    "medianResTime" : 631.0,
    "minResTime" : 0.0,
    "maxResTime" : 1653.0,
    "pct1ResTime" : 1414.4,
    "pct2ResTime" : 1583.3999999999999,
    "pct3ResTime" : 1653.0,
    "throughput" : 0.014594560198766234,
    "receivedKBytesPerSec" : 1.8108132154618273,
    "sentKBytesPerSec" : 0.00236990573227622
  },
  "GET users-1" : {
    "transaction" : "GET users-1",
    "sampleCount" : 2,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 367.0,
    "medianResTime" : 367.0,
    "minResTime" : 284.0,
    "maxResTime" : 450.0,
    "pct1ResTime" : 450.0,
    "pct2ResTime" : 450.0,
    "pct3ResTime" : 450.0,
    "throughput" : 0.028127021629679633,
    "receivedKBytesPerSec" : 0.31064702257896665,
    "sentKBytesPerSec" : 0.003282401449947965
  },
  "GET users-2" : {
    "transaction" : "GET users-2",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 137.0,
    "medianResTime" : 137.0,
    "minResTime" : 137.0,
    "maxResTime" : 137.0,
    "pct1ResTime" : 137.0,
    "pct2ResTime" : 137.0,
    "pct3ResTime" : 137.0,
    "throughput" : 7.299270072992701,
    "receivedKBytesPerSec" : 1522.1401687956204,
    "sentKBytesPerSec" : 0.8910241788321167
  },
  "GET users-0" : {
    "transaction" : "GET users-0",
    "sampleCount" : 2,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 339.5,
    "medianResTime" : 339.5,
    "minResTime" : 209.0,
    "maxResTime" : 470.0,
    "pct1ResTime" : 470.0,
    "pct2ResTime" : 470.0,
    "pct3ResTime" : 470.0,
    "throughput" : 0.028222676920905947,
    "receivedKBytesPerSec" : 0.012691936252028507,
    "sentKBytesPerSec" : 0.004836991991815424
  }
}